matrimonial-interface/app/controllers/application_controller.rb

    def current_user_profile
        @current_user_profile ||= Profile.find(session[:user_id]) if session[:user_id]
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]