matrimonial-interface/app/controllers/images_controller.rb

INSERT INTO "images" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "grumpy cat"], ["description", "he's mad"], ["created_at", "2021-01-17 03:48:23.862124"], ["updated_at", "2021-01-17 03:48:23.862124"]]
---
  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save

UPDATE "images" SET "description" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["description", "kinda mad but still majestic"], ["updated_at", "2021-01-17 05:53:31.998900"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @image.update(image_params)

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 8]]
---
  def destroy
    @image.destroy