matrimonial-interface/app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user = User.first
    respond_to do |format|
      if @profile.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "profiles" ("name", "created_at", "updated_at", "user_id", "age", "gender", "location") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "123"], ["created_at", "2021-10-13 23:16:09.989507"], ["updated_at", "2021-10-13 23:16:09.989507"], ["user_id", 4], ["age", 25], ["gender", "gender"], ["location", "location"]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "userID" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["userID", "1234"], ["updated_at", "2021-10-02 19:57:09.074323"], ["id", 1]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 2]]